back_end/app/controllers/matches_controller.rb

INSERT INTO "matches" ("user_id", "matcher_id", "confirmed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["matcher_id", 4], ["confirmed", false], ["created_at", "2020-04-08 16:20:55.325960"], ["updated_at", "2020-04-08 16:20:55.325960"]]
---
    def create

        match = Match.create(
            user_id: params[:user_id],
            matcher_id: params[:matcher_id],
            confirmed: false
        )

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def confirm
        user = User.find(params[:user_id])