back_end/app/models/user.rb

    def matches
        matchers_array = matches.map{|match| match.matcher if match.confirmed}

        matchers_array + inverse_matches.map{|match| match.user if match.confirmed}
---
SELECT "matches".* FROM "matches" WHERE "matches"."user_id" = $1  [["user_id", 1]]
SELECT "matches".* FROM "matches" WHERE "matches"."matcher_id" = $1  [["matcher_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def pending_matches
        matches.map{|match| match.matcher if !match.confirmed}.compact
---
SELECT "matches".* FROM "matches" WHERE "matches"."matcher_id" = $1  [["matcher_id", 1]]
SELECT "users".* FROM "users"

    def match_requests
        inverse_matches.map{|match| match.user if !match.confirmed}.compact
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def confirm_match(user)
        match = inverse_matches.find{|match| match.user === user}
        match.confirmed === true
        match.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "matches" SET "confirmed" = $1, "updated_at" = $2 WHERE "matches"."id" = $3  [["confirmed", true], ["updated_at", "2020-04-12 02:45:40.011328"], ["id", 19]]